In [1]:
# Show pandas module installed or not
pip show pandas

SyntaxError: invalid syntax (<ipython-input-1-4c03b6604398>, line 2)

In [3]:
# import pandas module
import pandas as pd

In [4]:
# Read csv file

df = pd.read_csv("demo_test_data.csv")
print(df)

    label  xcoord   ycoord  elevation    misc
0    GCP1  421773  2756199         76  corner
1    GCP2  421744  2756183         45    edge
2    GCP3  421793  2756182         45   angle
3    GCP4  421796  2756152         24      bc
4    GCP5  421755  2756141         34      tn
5    GCP6  421719  2756142         54      pk
6    GCP7  421707  2756184         76     lon
7    GCP8  421771  2756165         75     lat
8    GCP9  421793  2756128         32     tsc
9   GCP10  421718  2756208         77      bn
10  GCP11  421753  2756216         67      bn
11  GCP12  421811  2756170         87      vb
12  GCP13  421731  2756165         97      bv
13  GCP14  421702  2756150         54      sd
14  GCP15  421769  2756184         34      ds
15  GCP16  421800  2756214          6      gd
16  GCP17  421738  2756125         97      nm
17  GCP18  421827  2756139         90      tu
18  GCP19  421844  2756165         98      un
19  GCP20  421849  2756198         67      rg
20  GCP21  421824  2756201         79      rf
21  GCP22  421775  2756132         57      gn
22  GCP23  421826  2756125         56      pk
23  GCP24  421848  2756147         34      ls
24  GCP25  421726  2756111          7      re
25  GCP26  421767  2756114         88      we
26  GCP27  421806  2756114         56      rt
27  GCP28  421703  2756115         56      tu
28  GCP29  421698  2756211          4       x
29  GCP30  421851  2756219         23      lu
30  GCP31  421845  2756115         22      ct

In [ ]:
# Show statistics of the column
df.describe()

In [ ]:
# Show first five rows
df.head(5)

In [ ]:
# Show last five rows
df.tail(5)

In [ ]:
# Show specific column
df[['label', 'xcoord', 'ycoord']].head(5)

In [ ]:
# Show data by using row and column
df.iloc[1,3]

In [ ]:
# Show data by using some condition
df.loc[df['elevation']== 56]

In [ ]:
# Add column
df['total'] = df['xcoord'] + df['ycoord'] + df['elevation']
df

In [ ]:
# Write to csv, excel, json, dict
df.to_csv('hi.csv')

In [ ]:
# Drop column
df.drop(columns='total')

In [46]:
# Convert dict, list, series to dataframe
students = [ ('Jack', 34, 'Sydeny' , 'Australia') ,
             ('Riti', 30, 'Delhi' , 'India' ) ,
             ('Vikas', 31, 'Mumbai' , 'India' ) ,
             ('Neelu', 32, 'Bangalore' , 'India' ) ,
             ('John', 16, 'New York' , 'US') ,
             ('Mike', 17, 'las vegas' , 'US')  ]

df1 = pd.DataFrame(students, columns=['name', 'age', 'city', 'country'])
print(df1)

    name  age       city    country
0   Jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [15]:
df1

    name  age       city    country
0   Jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US

In [8]:
# Adding Header
sno = [1, 2, 3, 4, 5, 6]
df1['sno']=sno
print(df1)

    name  age       city    country  sno
0   Jack   34     Sydeny  Australia    1
1   Riti   30      Delhi      India    2
2  Vikas   31     Mumbai      India    3
3  Neelu   32  Bangalore      India    4
4   John   16   New York         US    5
5   Mike   17  las vegas         US    6

In [ ]:
# Adding row by dictionary
df.append({'name':'Bipin', 'city':'Bangalore'}, ignore_index=True)

In [ ]:
# Adding row by series
df.append(pd.Series(['Praveen', 28, 'Mysore', 'India', 7], index=df.columns), ignore_index=True)

In [47]:
# Adding row by dataframe
boys = [ ('ram', 60, 'Sydeny' , 'Australia') ,
             ('rahim', 30, 'Delhi' , 'India' )]

df2 = pd.DataFrame(boys, columns=['name', 'age', 'city', 'country'])
df1.append(df2, ignore_index=True, sort=False)

    name  age       city    country
0   Jack   34     Sydeny  Australia
1   Riti   30      Delhi      India
2  Vikas   31     Mumbai      India
3  Neelu   32  Bangalore      India
4   John   16   New York         US
5   Mike   17  las vegas         US
6    ram   60     Sydeny  Australia
7  rahim   30      Delhi      India

In [48]:
df2

    name  age    city    country
0    ram   60  Sydeny  Australia
1  rahim   30   Delhi      India

In [ ]:
# Sort the column
df.sort_values(by='name', ascending=False)

In [ ]:
# Rename the column
df.rename(columns={'city':'city_name'})

In [ ]:
# Export to csv without header & index
df.to_csv('demo.csv', header=False, index=True)

In [ ]:
# Changing the column header
column_names = ['name', 'age', 'city_new', 'country']
test = pd.read_csv('demo.csv', names = column_names)
print(test)

In [ ]:
# Changing the index
test.set_index(['name', 'country'])

In [ ]:
# Changing index
test.set_index([pd.Index([1, 2, 3, 4, 5, 6]), 'name'])

In [40]:
df2

    name  age    city    country
0    ram   34  Sydeny  Australia
1  rahim   30   Delhi      India

In [49]:
# Merge
boy = [ ('ram', 34, 'Sydeny' , 'Australia') ,
             ('rahim', 30, 'Delhi' , 'India' ),
              ('John', 16, 'New York' , 'US')]

df3 = pd.DataFrame(boy, columns=['name', 'age', 'city', 'country'])
# pd.merge(df2, df3)
df2.merge(df3)

    name  age   city country
0  rahim   30  Delhi   India

In [33]:
# Joining
# df1
df1.join(df2)

ValueError: columns overlap but no suffix specified: Index(['name', 'age', 'city', 'country'], dtype='object')